# Pandas concat()

In [2]:
import pandas as pd

df1=pd.DataFrame({
    'id' : [1, 2, 3], 
    'name' : ['Bob', 'Alice' , ' John']
}
)

In [4]:

df2=pd.DataFrame({
    'id' : [4, 5, 6], 
    'name' : ['Bobur', 'Johan' , ' Monica']
}
)

In [7]:
pd.concat([df1, df2], axis=1)

   id   name  id     name
0   1    Bob   4    Bobur
1   2  Alice   5    Johan
2   3   John   6   Monica

In [ ]:
pd.concat([df1, df2])

**merge()**
**for finding similarity in different data and merge them into one**

In [15]:
df1=pd.DataFrame({
    'id' : [1, 2, 3], 
    'name' : ['Bob', 'Alice' , ' John']
}
)
df1

   id   name
0   1    Bob
1   2  Alice
2   3   John

In [16]:
df2=pd.DataFrame({
    'id' : [2, 5, 1], 
    'score' : [50, 54 , 34]
}
)
df2

   id  score
0   2     50
1   5     54
2   1     34

In [17]:
result=pd.merge(df1, df2, on='id')
result

   id   name  score
0   1    Bob     34
1   2  Alice     50

**how**

In [18]:
df1=pd.DataFrame({
    'id' : [1, 2, 3], 
    'name' : ['Bob', 'Alice' , ' John']
}
)
df1

   id   name
0   1    Bob
1   2  Alice
2   3   John

In [19]:
df2=pd.DataFrame({
    'id' : [2, 5, 1], 
    'score' : [50, 54 , 34]
}
)
df2

   id  score
0   2     50
1   5     54
2   1     34

In [21]:
result=pd.merge(df1, df2, on='id', how='right')
result

   id   name  score
0   2  Alice     50
1   5    NaN     54
2   1    Bob     34

In [25]:
res_temp=pd.merge(df1, df2, on='id', how='left')
result

   id   name  score
0   1    Bob   34.0
1   2  Alice   50.0
2   3   John    NaN

In [26]:
res_temp[res_temp['score'].isna().drop(columns=['score'])]

   id   name  score
2   3   John    NaN

**grouping**

In [27]:
data={
    'Department' : ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Employee':['Sam', 'George', 'Town', 'Gither', 'Micheal', 'Bob'], 
    'Salary': [2000, 30000, 340000, 32113, 34113, 53432]
}

df=pd.DataFrame(data)
df

  Department Employee  Salary
0         HR      Sam    2000
1         HR   George   30000
2         IT     Town  340000
3         IT   Gither   32113
4    Finance  Micheal   34113
5    Finance      Bob   53432

In [29]:
unique_departments=df['Department'].drop_duplicates().tolist()
unique_departments

['HR', 'IT', 'Finance']

In [ ]:
import pandas as pd

data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Employee': ['Sam', 'George', 'Town', 'Gither', 'Micheal', 'Bob'],
    'Salary': [2000, 30000, 340000, 32113, 34113, 53432]
}

df = pd.DataFrame(data)

unique_departments = df['Department'].drop_duplicates().tolist()

for department in unique_departments:
    filtered = df[df['Department'] == department]
    max_sal = filtered['Salary'].max()
    print(f"Max salary in {department!r} is {max_sal}")

Max salary in 'HR' is 30000
Max salary in 'IT' is 340000
Max salary in 'Finance' is 53432

In [36]:
max_df=df.groupby('Department')['Salary'].max()
min_df=df.groupby('Department')['Salary'].min()
pd.merge(max_df, min_df, left_index=True, right_index=True)

            Salary_x  Salary_y
Department
Finance        53432     34113
HR             30000      2000
IT            340000     32113

In [43]:
max_df.reset_index()

  Department  Salary
0    Finance   53432
1         HR   30000
2         IT  340000

In [45]:
def custom(x):
    return x.max()-x.min()
df.groupby('Department')['Salary'].agg(['min', 'max', 'mean', custom])

              min     max      mean  custom
Department
Finance     34113   53432   43772.5   19319
HR           2000   30000   16000.0   28000
IT          32113  340000  186056.5  307887

In [49]:
data = {
    'Bonus': [123, 234, 421,643, 432, 134],
    'Employee': ['Sam', 'George', 'Town', 'Gither', 'Micheal', 'Bob'],
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Salary': [2000, 30000, 340000, 32113, 34113, 53432]
}
data_df=pd.DataFrame(data)
data_df

   Bonus Employee Department  Salary
0    123      Sam         HR    2000
1    234   George         HR   30000
2    421     Town         IT  340000
3    643   Gither         IT   32113
4    432  Micheal    Finance   34113
5    134      Bob    Finance   53432

In [50]:
data_df.groupby('Department')[['Salary', 'Bonus']].agg('max', 'min')

            Salary  Bonus
Department
Finance      53432    432
HR           30000    234
IT          340000    643